Dlubal.TimberPro.EffectiveLength
Member or set of members effective length parameters.

Dlubal.TimberPro.EffectiveLength.No
Member or set of members number

Dlubal.TimberPro.EffectiveLength.ID
Identifier

Dlubal.TimberPro.EffectiveLength.Comment
Comment

Dlubal.TimberPro.EffectiveLength.Tag
Tag

Dlubal.TimberPro.EffectiveLength.IsValid
Information if the object is valid or not (read only)

Dlubal.TimberPro.EffectiveLength.Length
Length of member or set of members

Dlubal.TimberPro.EffectiveLength.EnableBucklingAboutY
Enables/disables buckling about axis y.

Dlubal.TimberPro.EffectiveLength.BucklingLengthCoefficientY
Buckling about axis y length coefficient kcr,y

Dlubal.TimberPro.EffectiveLength.EffectiveLengthY
Effective length about axis y Lcr,y

Dlubal.TimberPro.EffectiveLength.EnableBucklingAboutZ
Enables/disables buckling about axis z.

Dlubal.TimberPro.EffectiveLength.BucklingLengthCoefficientZ
Buckling about axis z length coefficient kcr,z

Dlubal.TimberPro.EffectiveLength.EffectiveLengthZ
Effective length about axis z Lcr,z

Dlubal.TimberPro.EffectiveLength.EnableLTB
Enables/disables lateral-torsional buckling.

Dlubal.TimberPro.EffectiveLength.LTBLength
Effective length for lateral-torsional buckling Lcr